TMRh20/AutoAnalogAudio/src/NRF54l15/AutoAnalogAudio.cpp
/*
AutoAnalogAudio streaming via DAC & ADC by TMRh20
Copyright (C) 2016  TMRh20 - tmrh20@gmail.com, github.com/TMRh20

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

/****************************************************************************/

#if defined(ARDUINO_NRF54L15)

    #include "../AutoAnalogAudio.h"
    #include "nrf54l15_hal_support_internal.h"
    using xiao_nrf54l15::hal_internal::computePwmTiming;
    using xiao_nrf54l15::hal_internal::PwmTiming;

    #if !defined __MBED__
        #define myPDM NRF_PDM20
uint16_t AutoAnalog::adcBuffer16[MAX_BUFFER_SIZE];
uint8_t AutoAnalog::adcBuffer[MAX_BUFFER_SIZE];
bool AutoAnalog::adcReady;
bool AutoAnalog::adcWhichBuf;
uint8_t AutoAnalog::adcBitsPerSample;
uint32_t AutoAnalog::aSize;
uint8_t AutoAnalog::aCtr;
uint16_t* AutoAnalog::adcBuf0;
uint16_t* AutoAnalog::adcBuf1;
void (*AutoAnalog::_onReceive)(uint16_t* buf, uint32_t buf_len);
    #endif

    #define PDM_IRQ_PRIORITY 7
    #ifndef NRF_PDM_FREQ_1280K
        #define NRF_PDM_FREQ_1280K (0x0A000000UL) ///< PDM_CLK= 1.280 MHz (32 MHz / 25) => Fs= 20000 Hz
    #endif
    #ifndef NRF_PDM_FREQ_2667K
        #define NRF_PDM_FREQ_2667K (0x15000000UL)
    #endif
    #ifndef NRF_PDM_FREQ_2000K
        #define NRF_PDM_FREQ_2000K (0x10000000UL)
    #endif

/******************* USER DEFINES - Configure pins etc here *****************/
    #define DEFAULT_PDM_GAIN 40

    /* I2s default config  MAX98357A Breakout also needs SD pin set HIGH
    I2S_PIN_MCK    2   // Not used with MAX98357A
    I2S_PORT_MCK   0
    I2S_PIN_SCK    3   // BCLK
    I2S_PORT_SCK   0
    I2S_PIN_LRCK   29  // LRCK
    I2S_PORT_LRCK  0
    I2S_PIN_SDOUT  5   // GPIO Pin numbers
    I2S_PORT_SDOUT 0
    */

    /* PWM Config */
    #define DEFAULT_PWM_PIN  11 // GPIO Pin number
    #define DEFAULT_PWM_PORT 1 // On XIAO port 0 is for pins 1-5 port 1 is for all higher pins
                               //#define DEFAULT_PWM_PIN2 4  //Enable a second output pin
                               //#define DEFAULT_PWM_PORT2 0

    #ifndef PIN_PDM_DIN // Arduino pin numbers
        #define PIN_PDM_DIN 35
        //#define PIN_PDM_CLK 36
        #define PIN_PDM_PWR -1
    #endif

/****************************************************************************/
/* Public Functions */
/****************************************************************************/

uint8_t analogCounter = 0;
uint16_t mycounter = 0;
// int16_t sine_table[] = { 0, 0, 23170, 23170, 32767, 32767, 23170, 23170, 0, 0, -23170, -23170, -32768, -32768, -23170, -23170};
extern "C" {
 void SAADC_IRQHandler(void);
}


AutoAnalog::AutoAnalog()
{

    adcReady = true;
    adcBitsPerSample = 8;
    pwrPin = PIN_PDM_PWR;
    dinPin = PIN_PDM_DIN;
    clkPin = PIN_PDM_CLK;
    gain = -1;

    dacBitsPerSample = 8;
    autoAdjust = true;
    for (int i = 0; i < MAX_BUFFER_SIZE; i++) {
        dacBuffer[i] = 0;
    }

    aSize = MAX_BUFFER_SIZE;
    aCtr = 0;
    sampleCounter = 0;
    maxBufferSize = 0;
    I2S_PIN_MCK = 8;
    I2S_PORT_MCK = 2;
    I2S_PIN_SCK = 5;
    I2S_PORT_SCK = 1;
    I2S_PIN_LRCK = 7;
    I2S_PORT_LRCK = 1;
    I2S_PIN_SDOUT = 11;
    I2S_PORT_SDOUT = 1;
    I2S_PIN_SDIN = 10;
    I2S_PORT_SDIN = 1;
    manualI2S = false;
}

void AutoAnalog::begin(uint8_t enADC, uint8_t enDAC, uint8_t _useI2S)
{

    maxBufferSize = maxBufferSize > 0 ? maxBufferSize : MAX_BUFFER_SIZE;

    // Fix for backward compatiblity with badly thought out changes
    if (_useI2S == 1) {
        enDAC = 2;
    }
    else if (_useI2S == 2) {
        enADC = 2;
    }
    else if (_useI2S == 3) {
        enADC = 2;
        enDAC = 2;
    }
    else if (_useI2S == 4 || _useI2S == 5) {
        enADC = 3;
    }
    else if (_useI2S == 6) {
        enADC = 3;
        enDAC = 2;
    }

    enableADC = enADC;
    enableDAC = enDAC;

    if (enADC) {
        if (!adcBuffersAllocated) {
            adcBuffersAllocated = true;
            adcBuf0 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
            memset(adcBuf0, 0, maxBufferSize * 2);
            adcBuf1 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
            memset(adcBuf1, 0, maxBufferSize * 2);
        }
        adcSetup();
    }

    if (enDAC) {
        if (!dacBuffersAllocated) {
            dacBuffersAllocated = true;
            dacBuf0 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
            memset(dacBuf0, 0, maxBufferSize * 2);
            dacBuf1 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
            memset(dacBuf1, 0, maxBufferSize * 2);
        }
        dacSetup();
    }
}

/****************************************************************************/

void AutoAnalog::setSampleRate(uint32_t sampRate, bool stereo)
{

    if (enableDAC == 1) {
        NRF_PWM20->TASKS_STOP = 1;
        uint32_t timer = millis();
        while (NRF_PWM20->EVENTS_STOPPED == 0) {
            if (millis() - timer > 1000) {
                break;
            }
        }

        NRF_PWM20->COUNTERTOP = (((uint16_t)((16000000 / sampRate))) << PWM_COUNTERTOP_COUNTERTOP_Pos);
        NRF_PWM20->TASKS_DMA.SEQ[0].START = 1;
    }

    if (enableDAC == 2 || enableADC == 2) {

        if (stereo) {
            NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_Stereo << I2S_CONFIG_CHANNELS_CHANNELS_Pos;
        }
        else {
            NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_Left << I2S_CONFIG_CHANNELS_CHANNELS_Pos;
        }

