TMRh20/AutoAnalogAudio/src/NRF54l15/AutoAnalogAudio.cpp
            if (whichBuf) {
                memcpy(dacBuf0, dacBuffer16, samples * 4);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf0[0];
            }
            else {
                memcpy(dacBuf1, dacBuffer16, samples * 4);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf1[0];
            }
        }

        whichBuf = !whichBuf;

        uint8_t divider = 2;
        if (dacBitsPerSample == 16) {
            divider = 2;
        }
        else if (dacBitsPerSample == 24 || dacBitsPerSample == 32) {
            divider = 4;
        }

        NRF_I2S->RXTXD.MAXCNT = samples * divider;
        NRF_I2S->EVENTS_TXPTRUPD = 0;

        if (started) {
            NRF_I2S->TASKS_START = 1;
        }
    }
    else if (enableDAC == 1) {
        uint32_t timer = millis() + 1000;
        while (NRF_PWM20->EVENTS_DMA.SEQ[0].END == 0) {
            if (millis() > timer) {
                NRF_PWM20->TASKS_DMA.SEQ[0].START = 1;
                return;
            }
        }
        NRF_PWM20->EVENTS_DMA.SEQ[0].END = 0;

        if (dacBitsPerSample > 8) {
            if (whichBuf) {
                memcpy(dacBuf0, dacBuffer16, samples * 2);
            }
            else {
                memcpy(dacBuf1, dacBuffer16, samples * 2);
            }
        }
        else {
            if (whichBuf) {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf0[i] = (uint16_t)(dacBuffer[i] << 1);
                }
            }
            else {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf1[i] = (uint16_t)(dacBuffer[i] << 1);
                }
            }
        }
        if (whichBuf) {
            NRF_PWM20->DMA.SEQ[0].PTR = ((uint32_t)(&dacBuf0[0]) << PWM_DMA_SEQ_PTR_PTR_Pos);
        }
        else {
            NRF_PWM20->DMA.SEQ[0].PTR = ((uint32_t)(&dacBuf1[0]) << PWM_DMA_SEQ_PTR_PTR_Pos);
        }
        whichBuf = !whichBuf;

        NRF_PWM20->DMA.SEQ[0].MAXCNT = (samples << PWM_DMA_SEQ_MAXCNT_MAXCNT_Pos);
        NRF_PWM20->TASKS_DMA.SEQ[0].START = 1;
    }
}

/****************************************************************************/
/* Private Functions */
/****************************************************************************/

void AutoAnalog::dacBufferStereo(uint8_t dacChannel)
{
}

/****************************************************************************/

uint32_t AutoAnalog::frequencyToTimerCount(uint32_t frequency)
{

    return 1;
}

/****************************************************************************/

void AutoAnalog::startPwmI2sTimers()
{
            // 1. Setup BCLK (WS * 64)
            NRF_PWM20->PSEL.OUT[0] = I2S_PIN_SCK | I2S_PORT_SCK << 5 | 0 << 31;
            NRF_PWM20->ENABLE = 1;
            NRF_PWM20->MODE = PWM_MODE_UPDOWN_Up;
            NRF_PWM20->PRESCALER = PWM_PRESCALER_PRESCALER_DIV_1; // 16MHz
            NRF_PWM20->COUNTERTOP = 8;                            // 16MHz / 8 = 2MHz
            static uint16_t bclk_seq[] = {4};                    // 50% duty cycle
            NRF_PWM20->DECODER = PWM_DECODER_LOAD_Common;
            NRF_PWM20->DMA.SEQ[0].PTR = (uint32_t)bclk_seq;
            NRF_PWM20->DMA.SEQ[0].MAXCNT = 1;
            NRF_PWM20->TASKS_DMA.SEQ[0].START = 1;

            // 2. Setup WS (31.25kHz)
            NRF_PWM21->PSEL.OUT[0] = I2S_PIN_LRCK | I2S_PORT_LRCK << 5 | 0 << 31;
            NRF_PWM21->ENABLE = 1;
            NRF_PWM21->MODE = PWM_MODE_UPDOWN_Up;
            NRF_PWM21->PRESCALER = PWM_PRESCALER_PRESCALER_DIV_1;
            NRF_PWM21->COUNTERTOP = 512;       // 16MHz / 512 = 31.25kHz
            static uint16_t ws_seq[] = {128}; // 50% duty cycle
            NRF_PWM21->DECODER = PWM_DECODER_LOAD_Common;
            NRF_PWM21->DMA.SEQ[0].PTR = (uint32_t)ws_seq;
            NRF_PWM21->DMA.SEQ[0].MAXCNT = 1;
            NRF_PWM21->TASKS_DMA.SEQ[0].START = 1;
}

/****************************************************************************/
#define ARM_VTOR (*((volatile uint32_t *)0xE000ED08))

void AutoAnalog::adcSetup(void)
{

    if (enableADC == 2) {
        NRF_I2S->TASKS_STOP = 1;
        NRF_I2S->ENABLE = 0;

        NRF_I2S->CONFIG.RXEN = (I2S_CONFIG_RXEN_RXEN_Enabled << I2S_CONFIG_RXEN_RXEN_Pos);

        if (enableDAC != 2) {
            NRF_I2S->CONFIG.TXEN = (I2S_CONFIG_TXEN_TXEN_Disabled << I2S_CONFIG_TXEN_TXEN_Pos);
        }

        if (manualI2S) {
            // Slave mode, 16Bit, left aligned
            NRF_I2S->CONFIG.MODE = I2S_CONFIG_MODE_MODE_Master << I2S_CONFIG_MODE_MODE_Pos;
            NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_32Bit << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
            NRF_I2S->CONFIG.FORMAT = I2S_CONFIG_FORMAT_FORMAT_I2S << I2S_CONFIG_FORMAT_FORMAT_Pos;
            NRF_I2S->CONFIG.ALIGN = I2S_CONFIG_ALIGN_ALIGN_Right << I2S_CONFIG_ALIGN_ALIGN_Pos;
            NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_Enabled << I2S_CONFIG_MCKEN_MCKEN_Pos);
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
        else {
            NRF_I2S->CONFIG.MODE = I2S_CONFIG_MODE_MODE_Master << I2S_CONFIG_MODE_MODE_Pos;
            NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_16Bit << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
            NRF_I2S->CONFIG.FORMAT = I2S_CONFIG_FORMAT_FORMAT_I2S << I2S_CONFIG_FORMAT_FORMAT_Pos;
            NRF_I2S->CONFIG.ALIGN = I2S_CONFIG_ALIGN_ALIGN_Left << I2S_CONFIG_ALIGN_ALIGN_Pos;
            NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_Enabled << I2S_CONFIG_MCKEN_MCKEN_Pos);
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        }

        NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_Left << I2S_CONFIG_CHANNELS_CHANNELS_Pos;

        // Configure pins
        NRF_I2S->PSEL.MCK = (I2S_PIN_MCK << I2S_PSEL_MCK_PIN_Pos) | (I2S_PSEL_MCK_CONNECT_Connected << I2S_PSEL_MCK_CONNECT_Pos) | (I2S_PORT_MCK << I2S_PSEL_MCK_PORT_Pos);
        NRF_I2S->PSEL.SCK = (I2S_PIN_SCK << I2S_PSEL_SCK_PIN_Pos) | (I2S_PSEL_SCK_CONNECT_Connected << I2S_PSEL_SCK_CONNECT_Pos) | (I2S_PORT_SCK << I2S_PSEL_SCK_PORT_Pos);
        NRF_I2S->PSEL.LRCK = (I2S_PIN_LRCK << I2S_PSEL_LRCK_PIN_Pos) | (I2S_PSEL_LRCK_CONNECT_Connected << I2S_PSEL_LRCK_CONNECT_Pos) | (I2S_PORT_LRCK << I2S_PSEL_LRCK_PORT_Pos);
        NRF_I2S->PSEL.SDIN = (I2S_PIN_SDIN << I2S_PSEL_SDIN_PIN_Pos) | (I2S_PSEL_SDIN_CONNECT_Connected << I2S_PSEL_SDIN_CONNECT_Pos) | (I2S_PORT_SDIN << I2S_PSEL_SDIN_PORT_Pos);

        // Configure data pointer
        NRF_I2S->RXD.PTR = (uint32_t)adcBuf0;
        NRF_I2S->RXTXD.MAXCNT = 16; // / sizeof(uint32_t);
    }
    /*else if (enableADC == 1) {

