TMRh20/AutoAnalogAudio/src/NRF54l15/AutoAnalogAudio.cpp
        set_callback(adcCallback);

        // Enable high frequency oscillator if not already enabled
        if (NRF_CLOCK->EVENTS_XOSTARTED == 0) {
            NRF_CLOCK->TASKS_XOSTART = 1;
            while (NRF_CLOCK->EVENTS_XOSTARTED == 0) {
            }
        }

        // Set default 16khz sample rate
        NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio80 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);

    #if defined __MBED__

        nrf_pdm_clock_set(NRF_PDM_FREQ_1280K);
        // Set default channel mono
        nrf_pdm_mode_set(NRF_PDM_MODE_MONO, NRF_PDM_EDGE_LEFTFALLING);
        if (gain == -1) {
            gain = DEFAULT_PDM_GAIN;
        }
        nrf_pdm_gain_set(gain, gain);

        pinMode(clkPin, OUTPUT);
        digitalWrite(clkPin, LOW);

        pinMode(dinPin, INPUT);

        nrf_pdm_psel_connect(digitalPinToPinName(clkPin), digitalPinToPinName(dinPin));

        // Enable PDM interrupts and clear events
        nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
        nrf_pdm_event_clear(NRF_PDM_EVENT_END);
        nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
        nrf_pdm_int_enable(NRF_PDM_INT_STARTED | NRF_PDM_INT_STOPPED);

        // Turn on the mic
        if (pwrPin > -1) {
            pinMode(pwrPin, OUTPUT);
            digitalWrite(pwrPin, HIGH);
        }
        else {
        }

        // set the PDM IRQ priority and enable
        NVIC_SetPriority(PDM_IRQn, PDM_IRQ_PRIORITY);
        NVIC_ClearPendingIRQ(PDM_IRQn);
        NVIC_EnableIRQ(PDM_IRQn);

        // enable and trigger start task
        nrf_pdm_enable();
        nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
        nrf_pdm_task_trigger(NRF_PDM_TASK_START);

    #else // MBED / Non-Mbed

        nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_1280K);

        // Set default channel mono
        nrf_pdm_mode_set(myPDM, NRF_PDM_MODE_MONO, NRF_PDM_EDGE_LEFTFALLING);
        if (gain == -1) {
            gain = DEFAULT_PDM_GAIN;
        }
        nrf_pdm_gain_set(myPDM, gain, gain);

        pinMode(clkPin, OUTPUT);
        digitalWrite(clkPin, LOW);

        pinMode(dinPin, INPUT);

        nrf_pdm_psel_connect(myPDM, digitalPinToPinName(clkPin), digitalPinToPinName(dinPin));

        // Enable PDM interrupts and clear events
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_END);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STOPPED);
        nrf_pdm_int_enable(myPDM, NRF_PDM_INT_STARTED | NRF_PDM_INT_STOPPED);

        // Turn on the mic
        if (pwrPin > -1) {
            pinMode(pwrPin, OUTPUT);
            digitalWrite(pwrPin, HIGH);
        }
        else {
        }

        // set the PDM IRQ priority and enable
        NVIC_SetPriority(PDM_IRQn, PDM_IRQ_PRIORITY);
        NVIC_ClearPendingIRQ(PDM_IRQn);
        NVIC_EnableIRQ(PDM_IRQn);

        // enable and trigger start task
        nrf_pdm_enable(myPDM);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);
        nrf_pdm_task_trigger(myPDM, NRF_PDM_TASK_START);

    #endif
    }*/
    else if (enableADC == 3) {

        NRF_SAADC->CH[0].PSELP = 4 << SAADC_CH_PSELP_PIN_Pos | 1 << SAADC_CH_PSELP_PORT_Pos | 1 << SAADC_CH_PSELP_CONNECT_Pos | 0 << SAADC_CH_PSELP_INTERNAL_Pos;
        NRF_SAADC->CH[0].PSELN = 4 << SAADC_CH_PSELN_PIN_Pos | 1 << SAADC_CH_PSELN_PORT_Pos | 1 << SAADC_CH_PSELN_CONNECT_Pos | 0 << SAADC_CH_PSELN_INTERNAL_Pos;
        NRF_SAADC->CH[0].CONFIG = SAADC_CH_CONFIG_GAIN_Gain2 << SAADC_CH_CONFIG_GAIN_Pos | SAADC_CH_CONFIG_REFSEL_Internal << SAADC_CH_CONFIG_REFSEL_Pos | 40 << SAADC_CH_CONFIG_TACQ_Pos | SAADC_CH_CONFIG_MODE_Diff << SAADC_CH_CONFIG_MODE_Pos | SAADC_CH_CONFIG_BURST_Disabled << SAADC_CH_CONFIG_BURST_Pos;
        NRF_SAADC->RESOLUTION = SAADC_RESOLUTION_VAL_14bit << SAADC_RESOLUTION_VAL_Pos;
        NRF_SAADC->OVERSAMPLE = SAADC_OVERSAMPLE_OVERSAMPLE_Over2x << SAADC_OVERSAMPLE_OVERSAMPLE_Pos;
        NRF_SAADC->SAMPLERATE = 16000000 / 16000 / 2 | SAADC_SAMPLERATE_MODE_Timers << SAADC_SAMPLERATE_MODE_Pos;
        NRF_SAADC->RESULT.PTR = (uint32_t)adcBuf0;
        NRF_SAADC->RESULT.MAXCNT = 16;
        NRF_SAADC->ENABLE = true;

        NRF_SAADC->TASKS_CALIBRATEOFFSET = true;
        while (!NRF_SAADC->EVENTS_CALIBRATEDONE) {
        }

        NRF_SAADC->EVENTS_STARTED = 0;
        NRF_SAADC->TASKS_START = 1;
        while (!NRF_SAADC->EVENTS_STARTED) {
        };
        while (NRF_SAADC->STATUS == (SAADC_STATUS_STATUS_Busy << SAADC_STATUS_STATUS_Pos))
            ;

    uint32_t *vector_table = (uint32_t *)ARM_VTOR;
    vector_table[SAADC_IRQn + 16] = (uint32_t)SAADC_IRQHandler;
        NRF_SAADC->INTENSET = SAADC_INTENSET_END_Msk | SAADC_INTENSET_STARTED_Msk;
        NVIC_SetPriority(SAADC_IRQn, 7);
        NVIC_ClearPendingIRQ(SAADC_IRQn);
        NVIC_EnableIRQ(SAADC_IRQn);
        __enable_irq();
Serial.println("enable IRQ");
        NRF_SAADC->TASKS_SAMPLE = 1;
    } // USE_I2S
}

/****************************************************************************/

void AutoAnalog::adcInterrupts(bool enabled)
{
}

/****************************************************************************/

void AutoAnalog::dacSetup(void)
{

    if (enableDAC == 2) {
        NRF_I2S->TASKS_STOP = 1;
        NRF_I2S->ENABLE = 0;
        // Enable transmission

        if (enableADC != 2) {
            NRF_I2S->CONFIG.RXEN = (I2S_CONFIG_RXEN_RXEN_Disabled << I2S_CONFIG_RXEN_RXEN_Pos);
            //NRF_PWM0->TASKS_STOP = 1;
            //NRF_PWM1->TASKS_STOP = 1;
        }
        NRF_I2S->CONFIG.TXEN = (I2S_CONFIG_TXEN_TXEN_Enabled << I2S_CONFIG_TXEN_TXEN_Pos);

        
        if (manualI2S) {
            NRF_I2S->CONFIG.MODE = I2S_CONFIG_MODE_MODE_Master << I2S_CONFIG_MODE_MODE_Pos;
            NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_32Bit << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
            NRF_I2S->CONFIG.FORMAT = I2S_CONFIG_FORMAT_FORMAT_I2S << I2S_CONFIG_FORMAT_FORMAT_Pos;
            NRF_I2S->CONFIG.ALIGN = I2S_CONFIG_ALIGN_ALIGN_Right << I2S_CONFIG_ALIGN_ALIGN_Pos;
            NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_Enabled << I2S_CONFIG_MCKEN_MCKEN_Pos);
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;

        }else{
            // Enable MCK generator
            NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_Enabled << I2S_CONFIG_MCKEN_MCKEN_Pos);

