TMRh20/AutoAnalogAudio/src/NRF54l15/AutoAnalogAudio.cpp
extern "C" {
__attribute__((__used__)) void PDM_IRQHandler(void)
{
    if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_STARTED)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);

        // switch to fill

        if (AutoAnalog::aCtr) {
            nrf_pdm_buffer_set(myPDM, (uint32_t*)(AutoAnalog::adcBuf0), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf1, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }
        else {
            nrf_pdm_buffer_set(myPDM, (uint32_t*)(AutoAnalog::adcBuf1), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf0, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }

        // Flip to next buffer
        AutoAnalog::aCtr = (AutoAnalog::aCtr + 1) % 2;
    }
    else if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_STOPPED)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STOPPED);
    }
    else if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_END)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_END);
    }
}
}

extern "C" {
__attribute__((__used__)) void PWM0_IRQHandler(void)
{

    // AutoAnalog::sampleCounter++;
}
}
    #endif // defined __MBED__
*/
void AutoAnalog::set_callback(void (*function)(uint16_t* buf, uint32_t buf_len))
{
    _onReceive = function;
}

void AutoAnalog::adcCallback(uint16_t* buf, uint32_t buf_len)
{

    memcpy(adcBuffer16, buf, buf_len * 2);
    adcReady = true;
}


#endif //#if defined (ARDUINO_ARCH_SAM)